import { BurgerMenu } from "../vendor/burgerMenu.js";

export const mobMenu = new BurgerMenu({
    /*---Класс кнопки для открывания меню---*/
    openBtn: ".btnBurgerMenu",
    /*---Класс кнопки для закрытия меню (если кнопка для откр/закр одна - то оставить пустой)---*/
    closeBtn: ".close-mob-menu",
    /*---Иконка стрелки спойлера (svg или <i>)---*/
    arrowIcon: `
    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
  <path d="M8 8.10811L10.6 5.47297C10.8567 5.21279 11.2766 5.21279 11.5333 5.47297C11.7921 5.73521 11.7921 6.15668 11.5333 6.41892L8.71184 9.27854C8.32025 9.67542 7.67974 9.67542 7.28816 9.27854L4.4604 6.41257C4.20514 6.15385 4.20514 5.73804 4.4604 5.47932C4.72056 5.21565 5.1461 5.21565 5.40626 5.47932L8 8.10811Z" fill="#1D222F" />
</svg>
    `,
    /*---Скорость анимации появления меню (0.3)---*/
    menuAnimationTime: "",
    /*---Скорость анимации спойлеров (0.3)---*/
    spoilersAnimationTime: "",
    /*---Режим аккордиона---*/
    spoilersAccordion: false,
    /*---Сторона открывания меню horizontal/vertical---*/
    openingSide: "horizontal",
    /*---Разрешение при котором появиться меню---*/
    mediaShow: "768px"

})

// export const stickyMobMenu = new BurgerMenu({
//     /*---Класс кнопки для открывания меню---*/
//     openBtn: ".btnBurgerMenu-mob",
//     /*---Класс кнопки для закрытия меню (если кнопка для откр/закр одна - то оставить пустой)---*/
//     closeBtn: ".close-mob-menu",
//     /*---Иконка стрелки спойлера (svg или <i>)---*/
//     arrowIcon: `
//     <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
//   <path d="M8 8.10811L10.6 5.47297C10.8567 5.21279 11.2766 5.21279 11.5333 5.47297C11.7921 5.73521 11.7921 6.15668 11.5333 6.41892L8.71184 9.27854C8.32025 9.67542 7.67974 9.67542 7.28816 9.27854L4.4604 6.41257C4.20514 6.15385 4.20514 5.73804 4.4604 5.47932C4.72056 5.21565 5.1461 5.21565 5.40626 5.47932L8 8.10811Z" fill="#1D222F" />
// </svg>
//     `,
//     /*---Скорость анимации появления меню (0.3)---*/
//     menuAnimationTime: "",
//     /*---Скорость анимации спойлеров (0.3)---*/
//     spoilersAnimationTime: "",
//     /*---Режим аккордиона---*/
//     spoilersAccordion: false,
//     /*---Сторона открывания меню horizontal/vertical---*/
//     openingSide: "horizontal",
//     /*---Разрешение при котором появиться меню---*/
//     mediaShow: "768px"

// })